hpmicro/hpm_sdk/soc/HPM6P00/HPM6P41/HPM6P41_svd.xml
        <register>
          <name>adcx_cfg2</name>
          <description>adcx_cfg2</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>X_OFFSET</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>adcy_cfg0</name>
          <description>adcy_cfg0</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000019F</resetMask>
          <fields>
            <field>
              <name>Y_ADCSEL</name>
              <description>No description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_ADC_ENABLE</name>
              <description>No description available</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_CHAN</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>adcy_cfg1</name>
          <description>adcy_cfg1</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Y_PARAM1</name>
              <description>No description available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Y_PARAM0</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>adcy_cfg2</name>
          <description>adcy_cfg2</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Y_OFFSET</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>cal_cfg</name>
          <description>cal_cfg</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>0x00000100</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <fields>
            <field>
              <name>XY_DELAY</name>
              <description>valid x/y delay, larger than this delay will be treated as invalid data.
Default 1.25us@200MHz;   max 80ms;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phase_param</name>
          <description>phase_param</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PHASE_PARAM</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pos_threshold</name>
          <description>pos_threshold</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POS_THRESHOLD</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>uvw_pos0,uvw_pos1,uvw_pos2,uvw_pos3,uvw_pos4,uvw_pos5</dimIndex>
          <name>UVW_POS[%s]</name>
          <description>no description available</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UVW_POS0</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>uvw_pos0_cfg,uvw_pos1_cfg,uvw_pos2_cfg,uvw_pos3_cfg,uvw_pos4_cfg,uvw_pos5_cfg</dimIndex>
          <name>UVW_POS_CFG[%s]</name>
          <description>no description available</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <fields>
            <field>
              <name>POS_EN</name>
              <description>No description available</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>U_POS_SEL</name>
              <description>No description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>V_POS_SEL</name>
              <description>No description available</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>W_POS_SEL</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phase_cnt</name>
          <description>phase_cnt</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PHASE_CNT</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phase_update</name>
          <description>phase_update</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INC</name>
              <description>set to add value to phase_cnt</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DEC</name>
              <description>set to minus value from phase_cnt(set inc and dec same time willl act inc)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>value to be added or minus from phase_cnt. only valid when inc or dec is set in one 32bit write operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>position</name>
          <description>position</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POSITION</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>position_update</name>
          <description>position_update</description>
          <addressOffset>0x28c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INC</name>
              <description>set to add value to position</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DEC</name>
              <description>set to minus value from position(set inc and dec same time willl act inc)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VALUE</name>
              <description>value to be added or minus from position. only valid when inc or dec is set in one 32bit write operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>angle</name>
          <description>angle</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANGLE</name>
              <description>No description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pos_timeout</name>
          <description>pos_timeout</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <resetValue>0x7FFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>enable position timeout feature, if timeout, send valid again</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>postion timeout value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>togi_cfg0</name>
          <description>togi_cfg0</description>
          <addressOffset>0x2c0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000000</resetMask>
          <fields>
            <field>
              <name>SIN_TOGI</name>
              <description>set to use TOGI architecture for single SIN input</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>togi_cfg1</name>
          <description>togi_cfg1</description>
          <addressOffset>0x2c4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>W_PARAM</name>
              <description>w_param is angle speed, which is  2*PI*signal_hz/adc_sample_rate*2^28.
for example, 50Hz signal with 1MHz ADC sample rate, angle speed is 2*3.14159*50/1000000*0x10000000,
which is 84331(0x1496B, default value)
if 50Hz with 2MHz sample rate, should config to 0xA4B6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>sinp_acc</name>
          <description>sinp_acc</description>
          <addressOffset>0x2d0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINP_ACC</name>
              <description>positive SIN value acc in one period, updated when calculated SIN from pos to neg.
each SIN value is 16bit unsinged value(0x8000 for SIN30(0.5) )</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>sinn_acc</name>
          <description>sinn_acc</description>
          <addressOffset>0x2d4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINN_ACC</name>
              <description>negative SIN value acc in one period, updated when calculated SIN from neg to pos
each SIN value is 16bit unsinged value(0x8000 for SIN330(-0.5) )</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>cosp_acc</name>
          <description>cosp_acc</description>
          <addressOffset>0x2d8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COSP_ACC</name>
              <description>positive COS value acc in one period, updated when calculated COS from pos to neg</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>cosn_acc</name>
          <description>cosn_acc</description>
          <addressOffset>0x2dc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COSN_ACC</name>
              <description>negative COS value acc in one period, updated when calculated COS from neg to pos</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
