hpmicro/hpm_sdk/soc/HPM6P00/HPM6P41/HPM6P41_svd.xml
        <register>
          <name>adc_int_state</name>
          <description>the interrupt state</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>ACC_VLD_I_STA</name>
              <description>i_channel accumulate valid interrupt status for i_channel</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACC_VLD_Q_STA</name>
              <description>q_channel accumulate valid interrupt status for i_channel</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RISING_DELAY_I_STA</name>
              <description>i_channel delayed rectify signal rising edge interrupt status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FALLING_DELAY_I_STA</name>
              <description>i_channel delayed rectify signal falling edge interrupt status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RISING_DELAY_Q_STA</name>
              <description>q_channel delayed rectify signal rising edge interrupt status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FALLING_DELAY_Q_STA</name>
              <description>q_channel delayed rectify signal falling edge interrupt status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAMPLE_RISING_I_STA</name>
              <description>i_channel rising edge interrupt status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAMPLE_FALLING_I_STA</name>
              <description>i_channel falling edge interrupt status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAMPLE_RISING_Q_STA</name>
              <description>q_channel rising edge interrupt status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SAMPLE_FALLING_Q_STA</name>
              <description>q_channel falling edge interrupt status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACC_VLD_I_OVH_STA</name>
              <description>i_channel accumulate overflow interrupt status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACC_VLD_Q_OVH_STA</name>
              <description>q_channel accumulate overflow interrupt status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACC_VLD_I_OVL_STA</name>
              <description>i_channel accumulate underflow interrupt status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACC_VLD_Q_OVL_STA</name>
              <description>q_channel accumulate underflow interrupt status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACC_AMP_OVH_STA</name>
              <description>accumulate ample overflow interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ACC_AMP_OVL_STA</name>
              <description>accumulate ample underflow interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SDM0</name>
      <description>SDM0</description>
      <groupName>SDM</groupName>
      <baseAddress>0xf0450000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x110</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>SDM control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>
          <fields>
            <field>
              <name>SFTRST</name>
              <description>software reset the module if asserted to be1’b1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHMD</name>
              <description>Channel Rcv mode
Bits[2:0] for Ch0.
Bits[5:3] for Ch1
Bits[8:6] for Ch2
Bits[11:9] for Ch3
3'b000: Capture at posedge of MCLK
3'b001: Capture at both posedge and negedge of MCLK
3'b010: Manchestor Mode
3'b011: Capture at negedge of MCLK
3'b100: Capture at every other posedge of MCLK
3'b101: Capture at every other negedge of MCLK
Others: Undefined</description>
              <bitOffset>14</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_MCLK</name>
              <description>Asserted to double sync the mclk input pin before its usage inside the module</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_MDAT</name>
              <description>Asserted to double sync the mdat input pin before its usage inside the module</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_EN</name>
              <description>Channel Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EN</name>
          <description>Interrupt enable register.</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH3DRY</name>
              <description>Ch3 Data Ready interrupt enable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2DRY</name>
              <description>Ch2 Data Ready interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1DRY</name>
              <description>Ch1 Data Ready interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0DRY</name>
              <description>Ch0 Data Ready interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3ERR</name>
              <description>Ch3 Error interrupt enable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2ERR</name>
              <description>Ch2 Error interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1ERR</name>
              <description>Ch1 Error interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0ERR</name>
              <description>Ch0 Error interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status Registers</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH3DRY</name>
              <description>Ch3 Data Ready.
De-assert this bit by reading the data (or data fifo) registers.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2DRY</name>
              <description>Ch2 Data Ready</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1DRY</name>
              <description>Ch1 Data Ready</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0DRY</name>
              <description>Ch0 Data Ready</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3ERR</name>
              <description>Ch3 Error.
ORed together by channel related error signals and corresponding error interrupt enable signals.
De-assert this bit by write-1-clear the corresponding error status bits in the channel status registers.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2ERR</name>
              <description>Ch2 Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1ERR</name>
              <description>Ch1 Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CH0ERR</name>
              <description>Ch0 Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x40</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>CH[%s]</name>
          <description>no description available</description>
          <addressOffset>0x10</addressOffset>
          <register>
            <name>SDFIFOCTRL</name>
            <description>Data FIFO Path Control Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFF01F0</resetMask>
            <fields>
              <field>
                <name>GATE_SAMPLES</name>
                <description>The number-1-3 of input PDM bit samples to be gated when CIC_GATE_EN=1. Max 255. So the minimum gated samples is 4 samples when GATE_SAMPLES=0.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>THRSH</name>
                <description>FIFO threshold (0,..,16) (fillings &gt; threshold, then gen int)</description>
                <bitOffset>4</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SDCTRLP</name>
            <description>Data Path Control Primary Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFEFFFF</resetMask>
            <fields>
              <field>
                <name>MANCH_THR</name>
                <description>Manchester Decoding threshold. 3/4 of PERIOD_MCLK[7:0]</description>
                <bitOffset>25</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WDOG_THR</name>
                <description>Watch dog threshold for channel failure of CLK halting</description>
                <bitOffset>17</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFFOVIE</name>
                <description>Ch Data FIFO overflow interrupt enable</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DSATIE</name>
                <description>Ch CIC Data Saturation Interrupt Enable</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DRIE</name>
                <description>Ch Data Ready Interrupt Enable</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SYNCSEL</name>
                <description>Select the PWM SYNC Source</description>
                <bitOffset>7</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>FFSYNCCLREN</name>
                <description>Auto clear FIFO when a new SDSYNC event is found. Only valid when WTSYNCEN=1</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WTSYNACLR</name>
                <description>1: Asserted to Auto clear WTSYNFLG when the SDFFINT is gen
0: WTSYNFLG should be cleared manually by WTSYNMCLR</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WTSYNMCLR</name>
                <description>1: Manually clear WTSYNFLG. Auto-clear.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WTSYNCEN</name>
                <description>1: Start to store data only after PWM SYNC event
0: Start to store data whenever enabled</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D32</name>
                <description>1:32 bit data
0:16 bit data</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DR_OPT</name>
                <description>1: Use Data FIFO Ready as data ready when fifo fillings are greater than the threshold
0: Use Data Reg Ready as data ready</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EN</name>
                <description>Data Path Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SDCTRLE</name>
            <description>Data Path Control Extra Register</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFE77FFFF</resetMask>
            <fields>
              <field>
                <name>CIC_GATE_TYPE</name>
                <description>1: the gate cycle is determined by SDFIFOCTRLn[GATE_SAMPLES].
0: the gate cycle is determined by the CIC decimation counter, and the minimal gated off PDM bits are determined by SDFIFOCTRLn[GATE_SAMPLES], and at the same time, to keep alignment with normal PCM sampling time.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CIC_GATE_POL</name>
                <description>1: When mask signal is 1, pause the CIC stage at he rising edge of mask signal.
0: When mask signal is 0, pause the CIC stage at he falling edge of mask signal.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CIC_GATE_SEL</name>
                <description>Select the mask signal for CIC gate signal.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CIC_GATE_EN</name>
                <description>1: the CIC stage can be paused by the mask input.
0: the CIC stage won't be paused by the mask input.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TIMESTAMP_TYPE</name>
                <description>1. Use the time (when the data is calculated out) - delta_time_of_filter_span as the timestamp.
0: Use the time when the data is calculated out.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DFIFO_S_T</name>
                <description>1: the output of SDFIFO is data and timestamp interleaved. First is data.
0: the output of SDFIFO is data only</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_S_T</name>
                <description>"1: the read output of SData is data and timestamp interleaved. First is data.
0: the read output of SData is data only"</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SGD_ORDR</name>
                <description>CIC order
0: SYNC1
1: SYNC2
2: SYNC3
3: FAST_SYNC</description>
                <bitOffset>17</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PWMSYNC</name>
                <description>Asserted to double sync the PWM trigger signal</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CIC_SCL</name>
                <description>CIC shift control</description>
                <bitOffset>11</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CIC_DEC_RATIO</name>
                <description>CIC decimation ratio. 0 means div-by-256</description>
                <bitOffset>3</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IGN_INI_SAMPLES</name>
                <description>NotZero: Don't store the first samples that are not accurate
Zero: Store all samples</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
